MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG144/mcu.h
extern volatile __OFF131bits_t OFF131bits __asm__ ("OFF131") __attribute__((section("sfrs"), address(0xBF81074C)));
#define OFF132 OFF132
extern volatile uint32_t   OFF132 __attribute__((section("sfrs"), address(0xBF810750)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF132bits_t;
extern volatile __OFF132bits_t OFF132bits __asm__ ("OFF132") __attribute__((section("sfrs"), address(0xBF810750)));
#define OFF133 OFF133
extern volatile uint32_t   OFF133 __attribute__((section("sfrs"), address(0xBF810754)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF133bits_t;
extern volatile __OFF133bits_t OFF133bits __asm__ ("OFF133") __attribute__((section("sfrs"), address(0xBF810754)));
#define OFF134 OFF134
extern volatile uint32_t   OFF134 __attribute__((section("sfrs"), address(0xBF810758)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF134bits_t;
extern volatile __OFF134bits_t OFF134bits __asm__ ("OFF134") __attribute__((section("sfrs"), address(0xBF810758)));
#define OFF135 OFF135
extern volatile uint32_t   OFF135 __attribute__((section("sfrs"), address(0xBF81075C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF135bits_t;
extern volatile __OFF135bits_t OFF135bits __asm__ ("OFF135") __attribute__((section("sfrs"), address(0xBF81075C)));
#define OFF136 OFF136
extern volatile uint32_t   OFF136 __attribute__((section("sfrs"), address(0xBF810760)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF136bits_t;
extern volatile __OFF136bits_t OFF136bits __asm__ ("OFF136") __attribute__((section("sfrs"), address(0xBF810760)));
#define OFF137 OFF137
extern volatile uint32_t   OFF137 __attribute__((section("sfrs"), address(0xBF810764)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF137bits_t;
extern volatile __OFF137bits_t OFF137bits __asm__ ("OFF137") __attribute__((section("sfrs"), address(0xBF810764)));
#define OFF138 OFF138
extern volatile uint32_t   OFF138 __attribute__((section("sfrs"), address(0xBF810768)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF138bits_t;
extern volatile __OFF138bits_t OFF138bits __asm__ ("OFF138") __attribute__((section("sfrs"), address(0xBF810768)));
#define OFF139 OFF139
extern volatile uint32_t   OFF139 __attribute__((section("sfrs"), address(0xBF81076C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF139bits_t;
extern volatile __OFF139bits_t OFF139bits __asm__ ("OFF139") __attribute__((section("sfrs"), address(0xBF81076C)));
#define OFF140 OFF140
extern volatile uint32_t   OFF140 __attribute__((section("sfrs"), address(0xBF810770)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF140bits_t;
extern volatile __OFF140bits_t OFF140bits __asm__ ("OFF140") __attribute__((section("sfrs"), address(0xBF810770)));
#define OFF141 OFF141
extern volatile uint32_t   OFF141 __attribute__((section("sfrs"), address(0xBF810774)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF141bits_t;
extern volatile __OFF141bits_t OFF141bits __asm__ ("OFF141") __attribute__((section("sfrs"), address(0xBF810774)));
#define OFF142 OFF142
extern volatile uint32_t   OFF142 __attribute__((section("sfrs"), address(0xBF810778)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF142bits_t;
extern volatile __OFF142bits_t OFF142bits __asm__ ("OFF142") __attribute__((section("sfrs"), address(0xBF810778)));
#define OFF143 OFF143
extern volatile uint32_t   OFF143 __attribute__((section("sfrs"), address(0xBF81077C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF143bits_t;
extern volatile __OFF143bits_t OFF143bits __asm__ ("OFF143") __attribute__((section("sfrs"), address(0xBF81077C)));
#define OFF144 OFF144
extern volatile uint32_t   OFF144 __attribute__((section("sfrs"), address(0xBF810780)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF144bits_t;
extern volatile __OFF144bits_t OFF144bits __asm__ ("OFF144") __attribute__((section("sfrs"), address(0xBF810780)));
#define OFF145 OFF145
extern volatile uint32_t   OFF145 __attribute__((section("sfrs"), address(0xBF810784)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF145bits_t;
extern volatile __OFF145bits_t OFF145bits __asm__ ("OFF145") __attribute__((section("sfrs"), address(0xBF810784)));
#define OFF146 OFF146
extern volatile uint32_t   OFF146 __attribute__((section("sfrs"), address(0xBF810788)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF146bits_t;
extern volatile __OFF146bits_t OFF146bits __asm__ ("OFF146") __attribute__((section("sfrs"), address(0xBF810788)));
#define OFF147 OFF147
extern volatile uint32_t   OFF147 __attribute__((section("sfrs"), address(0xBF81078C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF147bits_t;
extern volatile __OFF147bits_t OFF147bits __asm__ ("OFF147") __attribute__((section("sfrs"), address(0xBF81078C)));
#define OFF148 OFF148
extern volatile uint32_t   OFF148 __attribute__((section("sfrs"), address(0xBF810790)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF148bits_t;
extern volatile __OFF148bits_t OFF148bits __asm__ ("OFF148") __attribute__((section("sfrs"), address(0xBF810790)));
#define OFF149 OFF149
extern volatile uint32_t   OFF149 __attribute__((section("sfrs"), address(0xBF810794)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF149bits_t;
extern volatile __OFF149bits_t OFF149bits __asm__ ("OFF149") __attribute__((section("sfrs"), address(0xBF810794)));
#define OFF150 OFF150
extern volatile uint32_t   OFF150 __attribute__((section("sfrs"), address(0xBF810798)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF150bits_t;
extern volatile __OFF150bits_t OFF150bits __asm__ ("OFF150") __attribute__((section("sfrs"), address(0xBF810798)));
#define OFF153 OFF153
extern volatile uint32_t   OFF153 __attribute__((section("sfrs"), address(0xBF8107A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF153bits_t;
extern volatile __OFF153bits_t OFF153bits __asm__ ("OFF153") __attribute__((section("sfrs"), address(0xBF8107A4)));
#define OFF154 OFF154
extern volatile uint32_t   OFF154 __attribute__((section("sfrs"), address(0xBF8107A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF154bits_t;
extern volatile __OFF154bits_t OFF154bits __asm__ ("OFF154") __attribute__((section("sfrs"), address(0xBF8107A8)));
#define OFF155 OFF155
extern volatile uint32_t   OFF155 __attribute__((section("sfrs"), address(0xBF8107AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF155bits_t;
